# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [6]:
# your code here

orders = pd.read_csv('Orders.zip')

In [7]:
orders.head(20)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
5,5,536365,22752,2010,12,3,8,set 7 babushka nesting boxes,2,2010-12-01 08:26:00,7.65,17850,United Kingdom,15.30
6,6,536365,21730,2010,12,3,8,glass star frosted t-light holder,6,2010-12-01 08:26:00,4.25,17850,United Kingdom,25.50
7,7,536366,22633,2010,12,3,8,hand warmer union jack,6,2010-12-01 08:28:00,1.85,17850,United Kingdom,11.10
8,8,536366,22632,2010,12,3,8,hand warmer red polka dot,6,2010-12-01 08:28:00,1.85,17850,United Kingdom,11.10
9,9,536367,84879,2010,12,3,8,assorted colour bird ornament,32,2010-12-01 08:34:00,1.69,13047,United Kingdom,54.08
10,10,536367,22745,2010,12,3,8,poppy's playhouse bedroom,6,2010-12-01 08:34:00,2.10,13047,United Kingdom,12.60
11,11,536367,22748,2010,12,3,8,poppy's playhouse kitchen,6,2010-12-01 08:34:00,2.10,13047,United Kingdom,12.60
12,12,536367,22749,2010,12,3,8,feltcraft princess charlotte doll,8,2010-12-01 08:34:00,3.75,13047,United Kingdom,30.00
13,13,536367,22310,2010,12,3,8,ivory knitted mug cosy,6,2010-12-01 08:34:00,1.65,13047,United Kingdom,9.90
14,14,536367,84969,2010,12,3,8,box of 6 assorted colour teaspoons,6,2010-12-01 08:34:00,4.25,13047,United Kingdom,25.50
15,15,536367,22623,2010,12,3,8,box of vintage jigsaw blocks,3,2010-12-01 08:34:00,4.95,13047,United Kingdom,14.85
16,16,536367,22622,2010,12,3,8,box of vintage alphabet blocks,2,2010-12-01 08:34:00,9.95,13047,United Kingdom,19.90
17,17,536367,21754,2010,12,3,8,home building block word,3,2010-12-01 08:34:00,5.95,13047,United Kingdom,17.85
18,18,536367,21755,2010,12,3,8,love building block word,3,2010-12-01 08:34:00,5.95,13047,United Kingdom,17.85
19,19,536367,21777,2010,12,3,8,recipe box with metal heart,4,2010-12-01 08:34:00,7.95,13047,United Kingdom,31.80

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [9]:
# your code here

#FIRST RESOLUTION

# First we add the total sum of expenses for each costumer to their CustumerID using the groupBy method


aggregated_spent = orders.groupby('CustomerID', as_index = False).agg({'amount_spent': 'sum'})
aggregated_spent

      CustomerID  amount_spent
0          12346      77183.60
1          12347       4310.00
2          12348       1797.24
3          12349       1757.55
4          12350        334.40
...          ...           ...
4334       18280        180.60
4335       18281         80.82
4336       18282        178.05
4337       18283       2094.88
4338       18287       1837.28

[4339 rows x 2 columns]

In [88]:
# After gruping each costumer to their total expense we use binnnig 
# with qcut to have same frequency binns in order to have binns with 
#values within the quantile we choose 
#then I add this values to a new column

#label 
labels = ['Preferred Customers','VIP']

cutoffs = [0.75,0.95,1]

orders['Costumer_groups'] = pd.qcut(aggregated_spent['amount_spent'],cutoffs, labels=labels)

orders['Costumer_groups']

0                         VIP
1         Preferred Customers
2         Preferred Customers
3         Preferred Customers
4                         NaN
                 ...
397919                    NaN
397920                    NaN
397921                    NaN
397922                    NaN
397923                    NaN
Name: Costumer_groups, Length: 397924, dtype: category
Categories (2, object): [Preferred Customers < VIP]

In [87]:
#

#DROP THE COSTUMERS WHO DONT FIT OUR SEARCH 

orders[['Costumer_groups','CustomerID']].dropna()

          Costumer_groups  CustomerID
0                     VIP       17850
1     Preferred Customers       17850
2     Preferred Customers       17850
3     Preferred Customers       17850
5     Preferred Customers       17850
...                   ...         ...
4319  Preferred Customers       14083
4320  Preferred Customers       14083
4328  Preferred Customers       13013
4337  Preferred Customers       13013
4338  Preferred Customers       13013

[1085 rows x 2 columns]

In [ ]:
####OTHER RESOLUTION ####

In [19]:
stats = filtered.describe()
stats.transpose()

#the 75 percebtil is 674.485

,count,mean,std,min,25%,50%,75%,max
CustomerID,4338.0,15300.408022,1721.808492,12346.00,13813.250,15299.500,16778.75,18287.00
amount_spent,4338.0,2054.266460,8989.230441,3.75,307.415,674.485,1661.74,280206.02

In [45]:
_75 = stats['amount_spent']['75%'] # guetting the 75% value of amount_spent from dataFrame describe() method 
_95 = aggregated_spent['amount_spent'].quantile(.95)

print(_75)
print(_95)

1661.7400000000007
5840.181999999983

In [46]:
#HERE WE SELECT THE COSTUMERS WHO INTEREST US 


filtered = aggregated_spent[(aggregated_spent['amount_spent'] > _75 )]
filtered.head(10)

    CustomerID  amount_spent
0        12346      77183.60
1        12347       4310.00
2        12348       1797.24
3        12349       1757.55
5        12352       2506.04
9        12356       2811.43
10       12357       6207.67
12       12359       6372.58
13       12360       2662.06
15       12362       5226.23

In [52]:

#HERE I LABEL BUT IN THIS CASE I USE COSTUM SIZE BINNS THAT WILL 
#GO FROM THE VALUE THAT REPRESENTS THE 75 QUANTIL AND GOES TO THE 95
# AND TO THE MAX 

labels = ['Preferred Customers','VIP']

cutoffs = [_75,_95,stats['amount_spent']['max'] ]

bins = pd.cut(filtered['amount_spent'],cutoffs, labels=labels)
bins

0                       VIP
1       Preferred Customers
2       Preferred Customers
3       Preferred Customers
5       Preferred Customers
               ...
4319    Preferred Customers
4320    Preferred Customers
4328    Preferred Customers
4337    Preferred Customers
4338    Preferred Customers
Name: amount_spent, Length: 1085, dtype: category
Categories (2, object): [Preferred Customers < VIP]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [86]:
# your code here
print(orders['Costumer_groups'].value_counts())
print('')
print(orders)

Preferred Customers    868
VIP                    217
Name: Costumer_groups, dtype: int64

        Unnamed: 0  InvoiceNo StockCode  year  month  day  hour  \
0                0     536365    85123A  2010     12    3     8
1                1     536365     71053  2010     12    3     8
2                2     536365    84406B  2010     12    3     8
3                3     536365    84029G  2010     12    3     8
4                4     536365    84029E  2010     12    3     8
...            ...        ...       ...   ...    ...  ...   ...
397919      541904     581587     22613  2011     12    5    12
397920      541905     581587     22899  2011     12    5    12
397921      541906     581587     23254  2011     12    5    12
397922      541907     581587     23255  2011     12    5    12
397923      541908     581587     22138  2011     12    5    12

                                Description  Quantity          InvoiceDate  \
0        white hanging heart t-light holder         6  2010-12-01 08:26:00
1                       white metal lantern         6  2010-12-01 08:26:00
2            cream cupid hearts coat hanger         8  2010-12-01 08:26:00
3       knitted union flag hot water bottle         6  2010-12-01 08:26:00
4            red woolly hottie white heart.         6  2010-12-01 08:26:00
...                                     ...       ...                  ...
397919          pack of 20 spaceboy napkins        12  2011-12-09 12:50:00
397920         children's apron dolly girl          6  2011-12-09 12:50:00
397921        childrens cutlery dolly girl          4  2011-12-09 12:50:00
397922      childrens cutlery circus parade         4  2011-12-09 12:50:00
397923        baking set 9 piece retrospot          3  2011-12-09 12:50:00

        UnitPrice  CustomerID         Country  amount_spent  \
0            2.55       17850  United Kingdom         15.30
1            3.39       17850  United Kingdom         20.34
2            2.75       17850  United Kingdom         22.00
3            3.39       17850  United Kingdom         20.34
4            3.39       17850  United Kingdom         20.34
...           ...         ...             ...           ...
397919       0.85       12680          France         10.20
397920       2.10       12680          France         12.60
397921       4.15       12680          France         16.60
397922       4.15       12680          France         16.60
397923       4.95       12680          France         14.85

            Costumer_groups  Country_vips_numb
0                       VIP                NaN
1       Preferred Customers                NaN
2       Preferred Customers                NaN
3       Preferred Customers                NaN
4                       NaN                NaN
...                     ...                ...
397919                  NaN                NaN
397920                  NaN                NaN
397921                  NaN                NaN
397922                  NaN                NaN
397923                  NaN                NaN

[397924 rows x 16 columns]

In [65]:


orders_new = orders[['Country','Costumer_groups']].dropna()
orders_new

             Country      Costumer_groups
0     United Kingdom                  VIP
1     United Kingdom  Preferred Customers
2     United Kingdom  Preferred Customers
3     United Kingdom  Preferred Customers
5     United Kingdom  Preferred Customers
...              ...                  ...
4319  United Kingdom  Preferred Customers
4320  United Kingdom  Preferred Customers
4328  United Kingdom  Preferred Customers
4337  United Kingdom  Preferred Customers
4338  United Kingdom  Preferred Customers

[1085 rows x 2 columns]

In [80]:
#FIRST FILTER BY VIP COSTUMER 

Country_vips = orders_new[(orders_new['Costumer_groups'] == 'VIP')]

In [81]:
#SECOND COUNT THE NUMBER OF COUNTRIES 

Country_vips_numb = Country_vips['Country'].value_counts()

Country_vips_numb

United Kingdom    204
Norway              9
EIRE                2
Spain               1
Australia           1
Name: Country, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [83]:
# your code here
#THE SAME AS THE QUESTION BEFORE 

Country_vips_pref = orders_new[(orders_new['Costumer_groups'] == 'VIP')| 
                         (orders_new['Costumer_groups'] == 'Preferred Customers')]
Country_vips_pref

             Country      Costumer_groups
0     United Kingdom                  VIP
1     United Kingdom  Preferred Customers
2     United Kingdom  Preferred Customers
3     United Kingdom  Preferred Customers
5     United Kingdom  Preferred Customers
...              ...                  ...
4319  United Kingdom  Preferred Customers
4320  United Kingdom  Preferred Customers
4328  United Kingdom  Preferred Customers
4337  United Kingdom  Preferred Customers
4338  United Kingdom  Preferred Customers

[1085 rows x 2 columns]

In [84]:
Country_vips_pref_numb = Country_vips_pref['Country'].value_counts()

Country_vips_pref_numb

United Kingdom    1035
Norway              17
EIRE                10
France               8
Germany              7
Australia            5
Spain                2
Switzerland          1
Name: Country, dtype: int64

In [ ]:
## I belive this could be done with One-Hot Encoding Categorical Variables
## NEED SOME TIME TO THINK ## Not much time now ## WILL TRY IT LATER